fixtures/demo_my_test/src/Catalogs/МобильныеУстройства/МобильныеУстройства.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>МобильныеУстройства</name>
  <owners>Catalog.Пользователи</owners>
  <attributes>
    <name>ИдентификаторПодписчикаДоставляемыхУведомлений</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>Подписчик</name>
    <type>
      <types>ExchangePlanRef.Мобильные</types>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

fixtures/demo_my_test/src/Catalogs/МобильныеУстройства/ManagerModule.bsl
//©///////////////////////////////////////////////////////////////////////////©//
//
//  Copyright 2021-2025 BIA-Technologies Limited Liability Company
//
//  Licensed under the Apache License, Version 2.0 (the "License");
//  you may not use this file except in compliance with the License.
//  You may obtain a copy of the License at
//
//      http://www.apache.org/licenses/LICENSE-2.0
//
//  Unless required by applicable law or agreed to in writing, software
//  distributed under the License is distributed on an "AS IS" BASIS,
//  WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
//  See the License for the specific language governing permissions and
//  limitations under the License.
//
//©///////////////////////////////////////////////////////////////////////////©//

Процедура НовыйИдентификаторПодписчикаУведомлений(Подписчик, Идентификатор) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	МобильныеУстройства.Ссылка КАК Ссылка,
	               |	МобильныеУстройства.ПометкаУдаления КАК ПометкаУдаления
	               |ИЗ
	               |	Справочник.МобильныеУстройства КАК МобильныеУстройства
	               |ГДЕ
	               |	МобильныеУстройства.Подписчик = &Подписчик";
	Запрос.УстановитьПараметр("Подписчик", Подписчик);
	Выборка = Запрос.Выполнить().Выбрать();
	Устройство = 0;
	Пока Выборка.Следующий() Цикл
		Если Выборка.ПометкаУдаления = Ложь Тогда
			Устройство = Выборка.Ссылка.ПолучитьОбъект();
			Прервать;
        КонецЕсли;
	КонецЦикла;
	
	Если Устройство = 0 Тогда
        Устройство = СоздатьЭлемент();
		Пользователь = ПользователиИнформационнойБазы.ТекущийПользователь();
		Устройство.Владелец = Справочники.Пользователи.НайтиПоКоду(Пользователь);
		Устройство.Подписчик = Подписчик;
	КонецЕсли;
	
	Устройство.ИдентификаторПодписчикаДоставляемыхУведомлений = Новый ХранилищеЗначения(Идентификатор);
	Устройство.Записать();
	
КонецПроцедуры
